<?php

/**
 * 题目描述:不用加减乘除做加法
 * 编写一个函数,求两个整数的和,要求在函数体内不得使用+,-,*,/四种运算符
 */

//思路:每一位相加后,先忽略进位,单独记录进位数,最后将相加的结果和进位数相加.
//转换为二进制,每一位相加忽略进位等同于做异或运算,单独计算进位等同于做与运算,之后再进行左移1位操作

function addNew($num1,$num2){
    while($num2 != 0){
        $sum = $num1 ^ $num2;
        $carry = ($num1 & $num2) << 1;
        $num1 = $sum;
        $num2 = $carry;
    }
    return $num1;
}

var_dump(addNew(14,18));

//不用新变量交换两个变量的值
function swap1(&$a,&$b){
    $a = $a+$b;
    $b = $a-$b;
    $a = $a-$b;
}

function swap2(&$a,&$b){
    //相同数字异或的结果都为0,0和数字的异或结果为该数字
    $a = $a^$b;
    $b = $a^$b;
    $a = $a^$b;//此时$b已经被替换为原始的$a,等价于$a^$a^$b
}
